{"entityID": "5543720", "text": "George James Rankin,  (1 May 1887 – 28 December 1957) was an Australian soldier and politician. He served in both the House of Representatives and the Senate, representing the Country Party of Australia.", "has_answer": true}
{"entityID": "5543720", "text": "Rankin was born at Bamawm, Victoria, the tenth child of Irish farmer James Rankin and Sarah, née Gallagher. He attended the local state school and became a farmer. In 1907, he joined the Militia, and was commissioned in the 9th Light Horse Regiment in 1909. He married Annie Isabella Oliver at Rochester, Victoria on 7 July 1912. In 1914, he was appointed a lieutenant of the Australian Imperial Force and posted to the 4th Light Horse Regiment.", "has_answer": false}

{"entityID": "5543720", "text": "Rankin served in the 4th Light Horse Regiment and reached Gallipoli in May 1915, was wounded in July, became a captain in December, and a major in March 1916. He also served in the Sinai, and was second in command of his unit from August 1917. Rankin was present at the famous charge at Beersheba on 31 October, and in 1918 was awarded the Distinguished Service Order (DSO) for his gallantry. His leadership subsequently earned him a Bar to his DSO. The bar's citation reads:\n\nFor great gallantry, dash and initiative during the operations from El Kuneitra to Damascus. On the 30th September, 1918, when his regiment acted as advance guard from Sasa to Kaukab, owing to his rapid movements, they captured 340 prisoners, 1 field gun and 8 machine guns. Kaukab was strongly held by the enemy, and when this officer was ordered to make a frontal attack his leadership was excellent and his regiment seized all objectives, capturing 9 officers, over 70 other ranks and 8 machine guns. In this action the enemy's cavalry were driven in disorder towards Damascus. On the morning of the 1st October, 1918, when ordered to seize the Military Barracks in Damascus, he showed great skill in manoeuvring his troops in such a manner that he was largely instrumental in capturing the whole enemy garrison in Damascus, numbering over 11,000.\nAfter the conclusion of the war, Rankin was sent to Egypt to suppress a rebellion, after which he returned to Australia. He returned to the Militia, becoming a brigadier in 1936 and a major general in 1937. During this time, he developed an interest in politics, in particular the Country Party.", "has_answer": false}
{"entityID": "5543720", "text": "Rankin was elected chief president of the Victorian United Country Party (VUCP) in 1937, but resigned later that year in order to contest the seat of Bendigo in the Australian House of Representatives. He was elected, and became part of the faction of the Country Party that advocated coalition with the United Australia Party. However, he was forced to back down on this by the State council of the VUCP.\nRankin became well known as an advocate of returned servicemen and wheat-farmers. He was a voracious critic of the Labor governments of John Curtin and Ben Chifley. When in 1949, an electoral redistribution substantially changed Rankin's seat, he contested the Senate instead and won. He was returned in 1951, but his parliamentary activity steadily decreased. He remained an active and vigorous anti-communist until his retirement, due to ill health, in 1955.\nRankin died of cerebrovascular disease on 28 December 1957 at Rochester, where he was buried, and was survived by his wife.", "has_answer": false}
{"entityID": "5543720", "text": "He was played by Serge Lazareff in the film The Lighthorsemen (1987).", "has_answer": false}
{"entityID": "6247345", "text": "John Mayne (1759–1836) was a Scottish printer, journalist and poet born in Dumfries. In 1780, his poem The Siller Gun appeared in its original form in Ruddiman's Magazine, published by Walter Ruddiman in Edinburgh. It is a humorous work on an ancient custom in Dumfries of shooting for the \"Siller Gun.\" He also wrote a poem on Hallowe'en in 1780 which influenced Robert Burns's 1785 poem Halloween. Mayne also wrote a version of the ballad Helen of Kirkconnel. His verses were admired by Walter Scott.", "has_answer": true}
{"entityID": "6247345", "text": "He was born at Dumfries on 26 March 1759. Educated at the local grammar school, he became a printer in the office of the Dumfries Journal. In 1782 he went with his family to Glasgow, where he worked for five years in the publishing house of the brothers Foulis. In 1787 he settled in London, first as a printer, and then as proprietor and joint editor of The Star, an evening paper, in which he placed his poems. He died at Lisson Grove, London, 14 March 1836.", "has_answer": false}
{"entityID": "6247345", "text": "Mayne wrote poetry in Dumfries, and after 1777 he contributed poems to Ruddiman's Weekly Magazine, Edinburgh. Between 1807 and 1817 several of his lyrics appeared in the Gentleman's Magazine.Mayne's Siller Gun was based on a Dumfries wapinschaw: the competitors were members of the corporations, and the prize a silver cannon-shaped tube presented by James VI. It consisted of twelve stanzas when it appeared in 1777. Enlarged to two cantos in 1779, and to three and four in 1780 and 1808 respectively, it took final shape in five cantos with notes in 1836. It was conceived in the spirit of Peblis to the Play.Hallowe'en, published in Ruddiman's Weekly Magazine in November 1780, may have stimulated Burns's brilliant treatment of the same theme, according to Chambers, Life and Work of Burns (i. 154, ed. 1851). Logan Braes, which appeared in the Star, 23 May 1789, had two lines plagiarised by Burns in a Logan Braes of his own. Glasgow, published in the Glasgow Magazine in December 1783, was enlarged and issued in 1803. In the same year Mayne published a patriotic address English, Scots, and Irishmen.", "has_answer": false}
